Autodesk.Revit.DB.Electrical.CableTraySizes.RemoveSize(Autodesk.Revit.DB.MEPSize)
Erases the existing MEPSize.
For cable tray, the nominal diameter is used in MEPSize.
Remarks:
Does nothing if there is no existing MEPSize with the specified nominal diameter.
sizeInfo:
The MEPSize to be removed..
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the function is called during iterating the size set.
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySizes.AddSize(Autodesk.Revit.DB.MEPSize)
Inserts a new MEPSize into the cable tray sizes.
For cable tray, the nominal diameter of MEPSize is used .
sizeInfo:
The new MEPSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is already the same size in the size set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The function is called during iterating the size set.
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySizes.GetCableTraySizes(Autodesk.Revit.DB.Document)
Gets the cable tray sizes of the project.
aDoc:
The document.
Returns:
The cable tray sizes of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017